# Termination Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..Termination Property
GroupTypeId Class See Also
---
Terminations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId Termination { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Termination As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Termination {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace